**Mini Proyek: Analisis Data Penjualan Toko Elektronik**

**Skenario:**

**Anda adalah seorang analis data di sebuah toko elektronik. Anda diberikan tiga set data terpisah:**
- Data transaksi penjualan harian.
- Data informasi pelanggan.
- Data detail produk.

**Tugas Anda adalah menggabungkan ketiga set data ini untuk menjawab beberapa pertanyaan bisnis penting.**

----

**Langkah 1: Persiapan Data**

In [7]:
import pandas as pd

# Data Transaksi Penjualan
data_penjualan = {
    'id_transaksi': ['T01', 'T02', 'T03', 'T04', 'T05', 'T06'],
    'id_pelanggan': [101, 102, 101, 103, 102, 104],
    'id_produk': ['P02', 'P01', 'P01', 'P03', 'P02', 'P04'],
    'jumlah': [1, 2, 1, 3, 1, 1]
}
penjualan = pd.DataFrame(data_penjualan)

# Data Pelanggan
data_pelanggan = {
    'id_pelanggan': [101, 102, 103, 104],
    'nama_pelanggan': ['Budi', 'Citra', 'Eka', 'Dian'],
    'kota': ['Jakarta', 'Bandung', 'Jakarta', 'Surabaya']
}
pelanggan = pd.DataFrame(data_pelanggan)

# Data Produk
data_produk = {
    'id_produk': ['P01', 'P02', 'P03', 'P04'],
    'nama_produk': ['Laptop', 'Mouse', 'Keyboard', 'Webcam'],
    'harga': [12000000, 250000, 500000, 800000]
}
produk = pd.DataFrame(data_produk)

# Tampilkan data untuk memastikan semuanya benar
print("--- Data Penjualan ---")
print(penjualan)
print("\n--- Data Pelanggan ---")
print(pelanggan)
print("\n--- Data Produk ---")
print(produk)

--- Data Penjualan ---
  id_transaksi  id_pelanggan id_produk  jumlah
0          T01           101       P02       1
1          T02           102       P01       2
2          T03           101       P01       1
3          T04           103       P03       3
4          T05           102       P02       1
5          T06           104       P04       1

--- Data Pelanggan ---
   id_pelanggan nama_pelanggan      kota
0           101           Budi   Jakarta
1           102          Citra   Bandung
2           103            Eka   Jakarta
3           104           Dian  Surabaya

--- Data Produk ---
  id_produk nama_produk     harga
0       P01      Laptop  12000000
1       P02       Mouse    250000
2       P03    Keyboard    500000
3       P04      Webcam    800000

---

**Langkah 2: Menggabungkan Data Penjualan dengan Data Pelanggan (one(pelanggan) to many(many))**

**Gabungkan penjualan (sebagai DataFrame kiri) dengan pelanggan (sebagai DataFrame kanan) menggunakan kolom id_pelanggan. Simpan hasilnya ke dalam DataFrame baru bernama penjualan_pelanggan**

In [8]:
penjualan_pelanggan = penjualan.merge(pelanggan, on='id_pelanggan')
penjualan_pelanggan

  id_transaksi  id_pelanggan id_produk  jumlah nama_pelanggan      kota
0          T01           101       P02       1           Budi   Jakarta
1          T02           102       P01       2          Citra   Bandung
2          T03           101       P01       1           Budi   Jakarta
3          T04           103       P03       3            Eka   Jakarta
4          T05           102       P02       1          Citra   Bandung
5          T06           104       P04       1           Dian  Surabaya

----

**Langkah 3: Menggabungkan Hasil dengan Data Produk**

**Lanjutkan dari DataFrame penjualan_pelanggan, gabungkan dengan DataFrame produk menggunakan kolom id_produk. Simpan hasil akhirnya ke dalam DataFrame bernama laporan_lengkap.**

In [9]:
laporan_lengkap = penjualan_pelanggan.merge(produk, on='id_produk')
laporan_lengkap

,id_transaksi,id_pelanggan,id_produk,jumlah,nama_pelanggan,kota,nama_produk,harga
0,T01,101,P02,1,Budi,Jakarta,Mouse,250000
1,T02,102,P01,2,Citra,Bandung,Laptop,12000000
2,T03,101,P01,1,Budi,Jakarta,Laptop,12000000
3,T04,103,P03,3,Eka,Jakarta,Keyboard,500000
4,T05,102,P02,1,Citra,Bandung,Mouse,250000
5,T06,104,P04,1,Dian,Surabaya,Webcam,800000

In [13]:
## additional
# # Menggabungkan tiga DataFrame sekaligus dengan metode chaining
# laporan_lengkap_chained = penjualan.merge(pelanggan, on='id_pelanggan').merge(produk, on='id_produk')
# laporan_lengkap_chained

**additonal analisis**

**Gunakan DataFrame laporan_lengkap untuk menjawab pertanyaan berikut:**

**1. Hitung Total Pendapatan per Transaksi.**
- Buat kolom baru bernama total_harga yang merupakan hasil perkalian dari kolom jumlah dan harga.

**2. Siapa Pelanggan dengan Total Belanja Terbanyak?**
- Gunakan groupby() pada kolom nama_pelanggan dan jumlahkan total_harga.

**3. Produk Apa yang Paling Banyak Terjual (berdasarkan kuantitas)?**
- Gunakan groupby() pada nama_produk dan jumlahkan jumlah

In [17]:
# hitung total pendapatan per transaksi
laporan_lengkap['total_harga'] = laporan_lengkap['jumlah'] * laporan_lengkap['harga']

laporan_lengkap.sort_values('total_harga',ascending=False, inplace=True)
laporan_lengkap

,id_transaksi,id_pelanggan,id_produk,jumlah,nama_pelanggan,kota,nama_produk,harga,total_harga
1,T02,102,P01,2,Citra,Bandung,Laptop,12000000,24000000
2,T03,101,P01,1,Budi,Jakarta,Laptop,12000000,12000000
3,T04,103,P03,3,Eka,Jakarta,Keyboard,500000,1500000
5,T06,104,P04,1,Dian,Surabaya,Webcam,800000,800000
0,T01,101,P02,1,Budi,Jakarta,Mouse,250000,250000
4,T05,102,P02,1,Citra,Bandung,Mouse,250000,250000

In [28]:
# Siapa Pelanggan dengan Total Belanja Terbanyak?
pelanggan_total_belanja_terbanyak = laporan_lengkap.groupby('nama_pelanggan')['total_harga'].sum()
# pelanggan_total_belanja_terbanyak
top_pelanggan = pelanggan_total_belanja_terbanyak.idxmax()
top_total_belanja = pelanggan_total_belanja_terbanyak.max()
print(f"Pelanggan dengan total belanja terbanyak adalah: {top_pelanggan} dengan total belanja Rp{top_total_belanja:,}")

Pelanggan dengan total belanja terbanyak adalah: Citra dengan total belanja Rp24,250,000

In [31]:
# Produk Apa yang Paling Banyak Terjual (berdasarkan kuantitas)?

produk_terlaris = laporan_lengkap.groupby('nama_produk')['jumlah'].sum()
top_produk = produk_terlaris.idxmax()
top_total_terjual = produk_terlaris.max()

print(f"Produk dengan total penjualan terbanyak/terlaris adalah: {top_produk} dengan total barang terjual sebanyak: {top_total_terjual} unit/pcs")

Produk dengan total penjualan terbanyak/terlaris adalah: Keyboard dengan total barang terjual sebanyak: 3 unit/pcs